Revit 2027 API
Application.NewXYZ Method
Creates a XYZ object at the origin.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ NewXYZ()
Public Function NewXYZ As XYZ
public:
XYZ^ NewXYZ()
member NewXYZ : unit -> XYZ
Return Value
XYZ
See Also
Reference
Application Class
NewXYZ Overload
Autodesk.Revit.Creation Namespace